src/InformationRegisters/SocialNetworks_Messages.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>SocialNetworks_Messages</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Incoming</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Outgoing</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Text</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>SocialConversation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SocialNetworks_Conversations</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SocialUser</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SocialNetworks_Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ChatId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>MessageId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/SocialNetworks_MessageMatches.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>SocialNetworks_MessageMatches</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>CSMessageID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SNMessageID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/SocialNetworks_Conversations.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>SocialNetworks_Conversations</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ConversationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MessagePointer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserRef</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Chats</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ChatId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SocialUser</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SocialNetworks_Users</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/SocialNetworks_Messages/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// This file is part of FoxyLink.
// Copyright © 2018 Petro Bazeliuk.
// 
// This program is free software: you can redistribute it and/or modify 
// it under the terms of the GNU Affero General Public License as 
// published by the Free Software Foundation, either version 3 of the License,
// or (at your option) any later version.
//
// This program is distributed in the hope that it will be useful, 
// but WITHOUT ANY WARRANTY; without even the implied warranty of 
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
// GNU Affero General Public License for more details.
//
// You should have received a copy of the GNU Affero General Public License 
// along with this program. If not, see <http://www.gnu.org/licenses/agpl-3.0>.
//
////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then
    
#Region ProgramInterface

// Creates social message.
//
// Parameters:
//  SocialMessage - Strucute - see function InformationRegister.SocialNetworks_Messages.NewSocialMessage.
//
Procedure CreateSocialMessage(SocialMessage) Export
    
    Conversation = Catalogs.SocialNetworks_Conversations
        .CollaborationSystemConversation(SocialMessage.SocialConversation);
    If Conversation = Undefined Then 
        
        Raise NStr(
                "en='Failed to find collaboration system conversation.';
                |ru='Не удалось найти обсуждение системы взаимодействия.';
                |uk='Не вдалось знайти обговорення системи взаємодії.';
                |en_CA='Failed to find collaboration system conversation.'");
        
    EndIf;
    
    If NOT ValueIsFilled(SocialMessage.CSMessageID) Then
        
        SetPrivilegedMode(True);
        
        Message = CollaborationSystem.CreateMessage(Conversation.ID);
        Message.Author = Catalogs.SocialNetworks_Users.CollaborationSystemUserID();
        FillPropertyValues(Message, SocialMessage);
        Message.Write();
        
        SetPrivilegedMode(False);
        
        SocialMessage.CSMessageID = String(Message.ID);
        
    EndIf;
    
    InformationRegisters.SocialNetworks_MessageMatches.WriteMessageMatch(
        SocialMessage.CSMessageID, SocialMessage.MessageId);
    
    RecordSet = InformationRegisters.SocialNetworks_Messages.CreateRecordSet();    
    RecordSet.Filter.SocialConversation.Set(SocialMessage.SocialConversation);
    RecordSet.Filter.SocialUser.Set(SocialMessage.SocialUser);
    RecordSet.Filter.ChatId.Set(SocialMessage.ChatId);
    RecordSet.Filter.MessageId.Set(SocialMessage.MessageId);
    
    FillPropertyValues(RecordSet.Add(), SocialMessage);
    
    RecordSet.Write();    
    
EndProcedure // CreateSocialMessage()

// Deletes social message.
//
// Parameters:
//  SocialMessage - Strucute - see function InformationRegister.SocialNetworks_Messages.NewSocialMessage.
//
Procedure DeleteSocialMessage(SocialMessage) Export
    
    RecordSet = InformationRegisters.SocialNetworks_Messages.CreateRecordSet();
    RecordSet.Filter.SocialConversation.Set(SocialMessage.SocialConversation);
    RecordSet.Filter.SocialUser.Set(SocialMessage.SocialUser);
    RecordSet.Filter.ChatId.Set(SocialMessage.ChatId);
    RecordSet.Filter.MessageId.Set(SocialMessage.MessageId);
    RecordSet.Write();
    
    If ValueIsFilled(SocialMessage.CSMessageID) Then
        
        InformationRegisters.SocialNetworks_MessageMatches.DeleteMessageMatch(
            SocialMessage.CSMessageID, SocialMessage.MessageId);
            
        SetPrivilegedMode(True);
        
        Try
            CollaborationSystem.DeleteMessage(New CollaborationSystemMessageID(
                SocialMessage.CSMessageID));
        Except
        EndTry;
            
        SetPrivilegedMode(False);
        
    EndIf;
    
EndProcedure // DeleteSocialMessage()

// Returns new social message.
//
// Returns:
//  Structure - with keys:
//      * SocialConversation - CatalogRef.SocialNetworks_Conversations - social conversation.
//      * SocialUser         - CatalogRef.SocialNetworks_Users         - social user.
//      * ChatId             - String                                  - chat identifier.
//      * MessageId          - String                                  - message identifier.
//      * Date               - Date                                    - message creation date.
//      * Incoming           - Boolean                                 - if True it is income message.
//      * Outgoing           - Boolean                                 - if True it is outgoing message.
//      * Text               - String                                  - message body.
//      * User               - CatalogRef.Users                        - Information base user.
//      * CSMessageID        - String                                  - сollaboration system message ID.
//
Function NewSocialMessage() Export
 
    SocialMessage = New Structure;
    SocialMessage.Insert("SocialConversation");
    SocialMessage.Insert("SocialUser");
    SocialMessage.Insert("ChatId");
    SocialMessage.Insert("MessageId");
    SocialMessage.Insert("Date");
    SocialMessage.Insert("Incoming");
    SocialMessage.Insert("Outgoing");
    SocialMessage.Insert("Text");
    SocialMessage.Insert("User");
    SocialMessage.Insert("CSMessageID");
    
    Return SocialMessage;
    
EndFunction // NewSocialMessage() 

#EndRegion // ProgramInterface

#EndIf
